<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="1" name="x" type="Parameter" version="opset1">
			<data shape="1,128,196" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="candidates" type="Parameter" version="opset1">
			<data shape="1,196,3000" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="candidates">
					<dim>1</dim>
					<dim>196</dim>
					<dim>3000</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/blocks.0/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Transpose_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Transpose_1987_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="588, 196" offset="24" size="230496" />
			<output>
				<port id="0" precision="FP16">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Transpose_1987" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/blocks.0/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Add_output_0,/blocks.0/MatMul_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>588</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_2091" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="230520" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/blocks.0/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>588</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Reshape_2_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/blocks.0/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/blocks.0/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_1938" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Squeeze_1939" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_1940" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="230560" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/blocks.0/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Squeeze_output_0">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/blocks.0/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="16" name="Constant_56" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="17" name="/blocks.0/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.0/Gather_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/blocks.0/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_14_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/blocks.0/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Reshape_3_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_64" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/blocks.0/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Transpose_2_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_2048_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="230616" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_2048" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="/blocks.0/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Mul_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/blocks.0/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230618" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_output_0" />
			</output>
		</layer>
		<layer id="26" name="Constant_58" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="27" name="/blocks.0/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.0/Gather_1_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/blocks.0/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_15_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/blocks.0/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Reshape_4_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_74" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230626" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/blocks.0/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Transpose_4_output_0">
					<dim>4</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/blocks.0/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/MatMul_1_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/blocks.0/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks.0/Softmax_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/blocks.0/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230650" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="35" name="Constant_60" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="36" name="/blocks.0/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.0/Gather_2_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/blocks.0/Constant_16" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_16_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/blocks.0/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Reshape_5_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_70" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/blocks.0/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Transpose_3_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/blocks.0/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/MatMul_2_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_79" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/blocks.0/Transpose_5" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Transpose_5_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Concat_399" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="230658" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/blocks.0/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Reshape_6_output_0">
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="blocks.0.out_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="196, 196" offset="230674" size="76832" />
			<output>
				<port id="0" precision="FP16">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="blocks.0.out_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="blocks.0.out_proj.weight">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/blocks.0/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Gemm_output_0">
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/blocks.0/Constant_19" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="307506" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.0/Constant_19_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="/blocks.0/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.0/Reshape_7_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Transpose_1992_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="588, 196" offset="307530" size="230496" />
			<output>
				<port id="0" precision="FP16">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Transpose_1992" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/blocks.1/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Add_output_0,/blocks.1/MatMul_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>588</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_2092" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="538026" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/blocks.1/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>588</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Reshape_2_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/blocks.1/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.1/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="/blocks.1/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_1945" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Squeeze_1946" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_1947" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="230560" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/blocks.1/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Squeeze_output_0">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_130" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="63" name="/blocks.1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.1/Gather_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="/blocks.1/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.1/Constant_10_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="/blocks.1/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Reshape_3_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_138" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/blocks.1/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Transpose_1_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_2049_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="230616" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_2049" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/blocks.1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Mul_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_132" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="72" name="/blocks.1/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.1/Gather_1_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/blocks.1/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.1/Constant_11_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/blocks.1/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Reshape_4_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_148" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230626" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/blocks.1/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Transpose_3_output_0">
					<dim>4</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/blocks.1/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/MatMul_1_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/blocks.1/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks.1/Softmax_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_134" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="80" name="/blocks.1/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.1/Gather_2_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/blocks.1/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.1/Constant_12_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/blocks.1/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Reshape_5_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_144" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/blocks.1/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Transpose_2_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/blocks.1/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/MatMul_2_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_153" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/blocks.1/Transpose_4" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Transpose_4_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Concat_405" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="230658" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/blocks.1/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Reshape_6_output_0">
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="blocks.1.out_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="196, 196" offset="538058" size="76832" />
			<output>
				<port id="0" precision="FP16">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="blocks.1.out_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="blocks.1.out_proj.weight">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/blocks.1/Gemm/WithoutBiases" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>196</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Gemm_output_0">
					<dim>128</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/blocks.1/Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="307506" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.1/Constant_15_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="/blocks.1/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.1/Reshape_7_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Transpose_1997_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="588, 196" offset="614890" size="230496" />
			<output>
				<port id="0" precision="FP16">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Transpose_1997" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/blocks.2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>588</dim>
					<dim>196</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Add_output_0,/blocks.2/MatMul_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>588</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_2093" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="538026" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/blocks.2/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>588</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Reshape_2_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/blocks.2/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" names="/blocks.2/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="/blocks.2/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_1952" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Squeeze_1953" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_1954" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="230560" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/blocks.2/Squeeze" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Squeeze_output_0">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_204" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="107" name="/blocks.2/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.2/Gather_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="/blocks.2/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.2/Constant_10_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/blocks.2/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Reshape_3_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_212" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/blocks.2/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Transpose_1_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_2050_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="230616" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_2050" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="/blocks.2/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Mul_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_206" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="116" name="/blocks.2/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.2/Gather_1_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/blocks.2/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.2/Constant_11_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/blocks.2/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Reshape_4_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_222" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230626" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="/blocks.2/Transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Transpose_3_output_0">
					<dim>4</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="/blocks.2/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>49</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/MatMul_1_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="/blocks.2/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/blocks.2/Softmax_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_208" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="230552" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="124" name="/blocks.2/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/blocks.2/Gather_2_output_0">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="/blocks.2/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="230592" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/blocks.2/Constant_12_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="/blocks.2/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>196</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Reshape_5_output_0">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Constant_218" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/blocks.2/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
					<dim>49</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/Transpose_2_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="/blocks.2/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/blocks.2/MatMul_2_output_0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_227" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="0" size="24" />
			<output>
